              &НаКлиенте
Перем ПропуститьПервуюАктивизацию;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Продавцы.ТолькоПросмотр = Истина;
	ПропуститьПервуюАктивизацию = Истина;
	
	Попытка
		ЗаполнитьСписокПродавцов();
	Исключение
		ПоказатьПредупреждение(, "ОШИБКА заполнения: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПродавцыПриАктивизацииСтроки(Элемент)
	// Первую (автоматическую) активизацию — пропускаем!
	Если ПропуститьПервуюАктивизацию Тогда
		ПропуститьПервуюАктивизацию = Ложь;
		Возврат;
	КонецЕсли;
	
	// КЛИК пользователя = ВЫБОР!
	ТекущиеДанные = Элементы.Продавцы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрОповещения = Новый Структура("Продавец", ТекущиеДанные.Продавец);
		Оповестить("ВыборПродавца", ПараметрОповещения);
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПродавцов()
	ДанныеДляЗагрузки = Неопределено;
	
	Если Параметры <> Неопределено
		И Параметры.Свойство("Продавцы", ДанныеДляЗагрузки)
		И ТипЗнч(ДанныеДляЗагрузки) = Тип("Массив")
		И ДанныеДляЗагрузки.Количество() > 0 Тогда
		
		Продавцы.Загрузить(ДанныеДляЗагрузки);
	Иначе
		Продавцы.Загрузить(ПолучитьТопПродавцовИзМакета());
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТопПродавцовИзМакета()
	тзДанные = Новый ТаблицаЗначений;
	
	Попытка
		ОбъектОбработки = Обработки.Тестирование.Создать();
		Макет = ОбъектОбработки.ПолучитьМакет("МакетЗадание3");
		тзДанные = ЗначениеИзСтрокиВнутр(Макет.ПолучитьТекст());
	Исключение
		Возврат Новый ТаблицаЗначений;
	КонецПопытки;
	
	ТоварыПоПродавцам = Новый Соответствие;
	Для Каждого Строка Из тзДанные Цикл
		Набор = ТоварыПоПродавцам.Получить(Строка.Продавец);
		Если Набор = Неопределено Тогда
			Набор = Новый Соответствие;
			ТоварыПоПродавцам.Вставить(Строка.Продавец, Набор);
		КонецЕсли;
		Набор.Вставить(Строка.Наименование, Истина);
	КонецЦикла;
	
	ТопПродавцы = Новый ТаблицаЗначений;
	ТопПродавцы.Колонки.Добавить("Продавец");
	ТопПродавцы.Колонки.Добавить("КоличествоЦен");
	
	Для Каждого КлючИЗначение Из ТоварыПоПродавцам Цикл
		НоваяСтрока = ТопПродавцы.Добавить();
		НоваяСтрока.Продавец = КлючИЗначение.Ключ;
		НоваяСтрока.КоличествоЦен = КлючИЗначение.Значение.Количество();
	КонецЦикла;
	
	ТопПродавцы.Сортировать("КоличествоЦен Убыв");
	
	Пока ТопПродавцы.Количество() > 10 Цикл
		ТопПродавцы.Удалить(ТопПродавцы.Количество() - 1);
	КонецЦикла;
	
	Возврат ТопПродавцы;
КонецФункции